replaced ascii art with proper diagram
